# Angle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Angle Property
SpecTypeId Class See Also
---
Angle, in discipline Common.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Angle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Angle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Angle {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace